app/views/l_produtos/_form.html.erb

        <div class="col-7">
          <%= f.association :l_categoria, collection: LCategoria.all, input_html: { class: "capitalize" }, placeholder: "L categoria", label_method: :descricao %>
---
SELECT "l_categorias".* FROM "l_categorias"