app/views/l_categorias/_form.html.erb

        <div class="col-4">
          <%= f.association :l_segmento,  collection: LSegmento.all,  label_method: :descricao,  value_method: :id,  input_html: { class: "capitalize" },  placeholder: "Segmento" %>
---
SELECT "l_segmentos".* FROM "l_segmentos"