app/controllers/l_categorias_controller.rb

INSERT INTO "l_categorias" ("nome", "descricao", "l_segmento_id", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @l_categoria = LCategoria.new(l_categoria_params)

    if @l_categoria.save