app/controllers/l_produtos_controller.rb

  def create
    @l_produto = LProduto.new(l_produto_params)

    if @l_produto.save
---
INSERT INTO "l_produtos" ("l_categoria_id", "titulo", "descricao", "preco", "quantidade_estoque", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @l_produto.update(l_produto_params)
---
UPDATE "l_produtos" SET "updated_at" = $1 WHERE "l_produtos"."id" = $2  [["updated_at", "2025-05-30 04:45:28.306175"], ["id", 2]]

  def destroy
    if @l_produto.destroy
---
DELETE FROM "l_produtos" WHERE "l_produtos"."id" = $1  [["id", 1]]

  def set_l_produto
    @l_produto = LProduto.find_by(id: params[:id])
---
SELECT "l_produtos".* FROM "l_produtos" WHERE "l_produtos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]