app/controllers/l_profissionais_controller.rb

INSERT INTO "l_profissionais" ("nome", "especialidade", "descricao", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome", "Kaik"], ["especialidade", "Industrial"], ["descricao", "FAZ TUDO"], ["deleted_at", nil], ["created_at", "2025-05-30 14:18:33.764038"], ["updated_at", "2025-05-30 14:18:33.764038"]]
---
  def create
    @l_profissional = LProfissional.new(l_profissional_params)

    if @l_profissional.save
      redirect_to l_profissionais_path, notice: t('messages.created_successfully')

UPDATE "l_profissionais" SET "updated_at" = $1 WHERE "l_profissionais"."id" = $2  [["updated_at", "2025-05-30 13:24:06.221800"], ["id", 1]]
---
  def update
    if @l_profissional.update(l_profissional_params)
      redirect_to l_profissionais_path, notice: t('messages.updated_successfully'), status: :see_other

DELETE FROM "l_profissionais" WHERE "l_profissionais"."id" = $1  [["id", 3]]
---
  def destroy
    if @l_profissional.destroy
      redirect_to l_profissionais_url, notice: t('messages.deleted_successfully')