app/controllers/l_segmentos_controller.rb

  def create
    @l_segmento = LSegmento.new(l_segmento_params)

    if @l_segmento.save
---
INSERT INTO "l_segmentos" ("descricao", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["descricao", "Produtos"], ["created_by", nil], ["updated_by", nil], ["deleted_at", nil], ["created_at", "2025-05-26 08:12:10.681457"], ["updated_at", "2025-05-26 08:12:10.681457"]]

  def destroy
    if @l_segmento.destroy
---
DELETE FROM "l_segmentos" WHERE "l_segmentos"."id" = $1  [["id", 1]]

  def set_l_segmento
    @l_segmento = LSegmento.find_by(id: params[:id])
---
SELECT "l_segmentos".* FROM "l_segmentos" WHERE "l_segmentos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]