app/controllers/l_tipo_usuarios_controller.rb

  def create
    @l_tipo_usuario = LTipoUsuario.new(l_tipo_usuario_params)


    if @l_tipo_usuario.save
---
INSERT INTO "l_tipo_usuarios" ("descricao", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["descricao", "ADM"], ["deleted_at", nil], ["created_at", "2025-05-19 16:28:04.023973"], ["updated_at", "2025-05-19 16:28:04.023973"]]

  def set_l_tipo_usuario
    @l_tipo_usuario = LTipoUsuario.find(params[:id])
---
SELECT "l_tipo_usuarios".* FROM "l_tipo_usuarios" WHERE "l_tipo_usuarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]