app/controllers/store_controller.rb

  def index
    @q = LCategoria.includes(:l_produtos).ransack(params[:q])
---
SELECT "l_produtos".* FROM "l_produtos" WHERE "l_produtos"."l_categoria_id" IN ($1, $2, $3, $4)  [["l_categoria_id", 4], ["l_categoria_id", 2], ["l_categoria_id", 1], ["l_categoria_id", 3]]