app/views/users/registrations/new.html.erb

            <!-- Tipo de Usuário -->
            <%= f.input :l_tipo_usuario_id, collection: LTipoUsuario.all.map { |t| [t.descricao, t.id] }, prompt: "Selecione um tipo", input_html: { class: "form-control" } %>
---
SELECT "l_tipo_usuarios".* FROM "l_tipo_usuarios"